OroJackson01/lpc4088-rfid-access-control/src/mfrc522_lpc40xx.c
/**
 * @file    mfrc522_lpc40xx.c
 * @brief   Funciones para acceder al lector RFID MFRC522 en modo SPI a través de una interfaz SSP
 * del LPC40xx.
 *
 * @author
 * @date
 * @version
 *
 * @copyright GNU General Public License version 3 or later
 *
 * Conexión hardware (según main_rfid.c):
 *   SSP2  SCK  → P5[2]  (lila)
 *   SSP2  MISO → P5[1]  (verde)
 *   SSP2  MOSI → P5[0]  (azul)
 *   GPIO  CS   → P2[14] (gris)   funcion_cs = FALSE
 *   GND        →  GND   (amarillo)
 *   3V3        →  3V3   (naranja)
 */

#include "mfrc522_lpc40xx.h"
#include <LPC407x_8x_177x_8x.h>
#include <string.h>
#include "tipos.h"
#include "error.h"
#include "gpio_lpc40xx.h"
#include "iocon_lpc40xx.h"
#include "spi_lpc40xx.h"
#include "timer_lpc40xx.h"

/* ============================================================
   Variables privadas del módulo
   ============================================================ */
static LPC_SSP_TypeDef   *mfrc522_ssp;            //!< Interfaz SSP a usar
static LPC_GPIO_TypeDef  *mfrc522_puerto_cs;       //!< Puerto para la señal /CS
static uint32_t           mfrc522_mascara_pin_cs;  //!< Máscara de pin para la señal /CS
static bool_t             mfrc522_funcion_cs;      //!< TRUE si el pin tiene función hardware SSEL
static LPC_TIM_TypeDef   *mfrc522_timer;           //!< Timer para retardos

/* ============================================================
   Constantes para mfrc522_detectar_tarjeta_con_escritura
   ============================================================
   TRAILER_BLOCK_HARDCODED: bloque trailer del sector 0.
     En MIFARE Classic 1K los sectores tienen 4 bloques (0-3, 4-7, ...).
     El bloque trailer (con las claves) es siempre el último del sector:
       sector 0 → trailer = bloque 3
       sector 1 → trailer = bloque 7, etc.
     Cambia este valor al sector que quieras autenticar.

   clave_A_sector: clave A por defecto de fábrica de MIFARE Classic (FF FF FF FF FF FF).
     Modifícala si tus tarjetas tienen una clave personalizada.
   ============================================================ */
#define TRAILER_BLOCK_HARDCODED   3u   /*!< Trailer del sector 0 (bloque 3) */

static const uint8_t clave_A_sector[6] = { 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF };

/* ============================================================
   Prototipos de funciones privadas
   ============================================================ */
static void    mfrc522_seleccionar_esclavo(bool_t nivel);
static void    mfrc522_escribir_registro(uint8_t registro, uint8_t dato);
static uint8_t mfrc522_leer_registro(uint8_t registro);
static void    mfrc522_activar_bits(uint8_t registro, uint8_t mascara);
static void    mfrc522_borrar_bits(uint8_t registro, uint8_t mascara);

/* ============================================================
   Inicialización
   ============================================================ */

/**
 * @brief   Inicializa la comunicación SPI entre el uC y el módulo MFRC522.
 *
 * @param[in]   interfaz_ssp      Ptr. a registros de la interfaz SSP a usar (p. ej. LPC_SSP2).
 * @param[in]   frecuencia_sck    Frecuencia de reloj SCK en Hz (máx. 10 MHz para el RC522).
 * @param[in]   puerto_sck        Puerto GPIO del pin SCK.
 * @param[in]   mascara_pin_sck   Máscara del pin SCK.
 * @param[in]   puerto_miso       Puerto GPIO del pin MISO.
 * @param[in]   mascara_pin_miso  Máscara del pin MISO.
 * @param[in]   puerto_mosi       Puerto GPIO del pin MOSI.
 * @param[in]   mascara_pin_mosi  Máscara del pin MOSI.
 * @param[in]   puerto_cs         Puerto GPIO del pin CS (/NSS).
 * @param[in]   mascara_pin_cs    Máscara del pin CS.
 * @param[in]   funcion_cs        TRUE  → el pin CS tiene función hardware SSEL del SSP.
 *                                FALSE → el pin CS es un GPIO ordinario (caso habitual con RC522).
 * @param[in]   timer             Ptr. a registros del timer para retardos (se inicializa aquí
 *                                cuando funcion_cs = FALSE).
 */
void mfrc522_inicializar(LPC_SSP_TypeDef  *interfaz_ssp, uint32_t frecuencia_sck,
                         LPC_GPIO_TypeDef *puerto_sck,   uint32_t mascara_pin_sck,
                         LPC_GPIO_TypeDef *puerto_miso,  uint32_t mascara_pin_miso,
                         LPC_GPIO_TypeDef *puerto_mosi,  uint32_t mascara_pin_mosi,
                         LPC_GPIO_TypeDef *puerto_cs,    uint32_t mascara_pin_cs,
                         bool_t funcion_cs, LPC_TIM_TypeDef *timer) {

  /* Inicializar el interfaz SPI/SSP:
   *   - 8 bits de datos
   *   - CPOL = 0, CPHA = 0  (RC522 muestrea en flanco de subida, modo SPI 0)
   *   - El SSP gestiona SSEL solo si funcion_cs = TRUE; si es FALSE lo gestionamos
   *     nosotros a mano desde mfrc522_seleccionar_esclavo().
   */
  spi_inicializar(interfaz_ssp, SPI_DATOS_8_BITS, frecuencia_sck, SPI_CPOL_0, SPI_CPHA_0,
                  puerto_sck,  mascara_pin_sck,
                  puerto_miso, mascara_pin_miso,
                  puerto_mosi, mascara_pin_mosi,
                  puerto_cs,   mascara_pin_cs,
                  funcion_cs);

  /* Guardar parámetros para uso en el resto de funciones del módulo */
  mfrc522_ssp           = interfaz_ssp;
  mfrc522_puerto_cs     = puerto_cs;
  mfrc522_mascara_pin_cs = mascara_pin_cs;
  mfrc522_funcion_cs    = funcion_cs;
  mfrc522_timer         = timer;

  /* Cuando CS es GPIO manual inicializamos el timer para poder hacer
   * retardos de microsegundos entre el flanco de CS y los pulsos de SCK */
  if (!funcion_cs) {
    timer_inicializar(timer);
    /* Asegurar que el CS empieza en alto (esclavo desactivado) */
    gpio_ajustar_dir(puerto_cs, mascara_pin_cs, DIR_SALIDA);
    gpio_pin_a_1(puerto_cs, mascara_pin_cs);
  }

  /* ---- Secuencia de inicialización del RC522 ---- */

  /* Reset por software: pone todos los registros a su valor por defecto */
  mfrc522_escribir_registro(MFRC522_COMMANDREG, MFRC522_SOFTRESET);

  /* Esperar ~37 µs que tarda el oscilador en estabilizarse tras el reset
   * (td = 1024 / 27.12 MHz ≈ 37.7 µs, ver datasheet sección 8.8.2) */
  timer_retardo_us(mfrc522_timer, 50);

  /* TModeReg:
   *   TAuto = 1         → el timer se inicia automáticamente al final de cada transmisión
   *   TPrescaler_Hi = 0x0D → parte alta del prescaler (junto con 0x3E forma 0xD3E = 3390)
   *   Con TPrescaler = 0xD3E y TReload = 0x0030:
   *     ftimer = 13.56 MHz / (2*3390 + 1) ≈ 2 kHz  → periodo ~500 µs
   *     tiempo espera = (0x0030 + 1) * 500 µs ≈ 24.5 ms  (más que suficiente para ISO14443)
   */
  mfrc522_escribir_registro(MFRC522_TMODEREG,     (1u << 7) | 0x0D);
  mfrc522_escribir_registro(MFRC522_TPRESCALERREG, 0x3E);

  /* TReloadReg: valor de recarga de 16 bits = 0x0030 */
  mfrc522_escribir_registro(MFRC522_TRELOADREGH, 0x00);
  mfrc522_escribir_registro(MFRC522_TRELOADREGL, 0x30);

  /* RFCfgReg: RxGain = 111b → ganancia del receptor máxima (48 dB) */
  mfrc522_escribir_registro(MFRC522_RFCFGREG, (7u << 4));

  /* TxASKReg: Force100ASK = 1 → fuerza modulación ASK al 100 % */
  mfrc522_escribir_registro(MFRC522_TXASKREG, (1u << 6));

  /* ModeReg:
   *   TxWaitRF  = 1  → el transmisor solo arranca si hay campo RF
   *   PolMFin   = 1  → pin MFIN activo a nivel alto
   *   CRCPreset = 01 → preset del coprocesador CRC = 0x6363 (ISO/IEC 14443)
   */
  mfrc522_escribir_registro(MFRC522_MODEREG, (1u << 5) | (1u << 3) | 0x01);

  /* Activar la antena (pines TX1 y TX2) */
  mfrc522_antena_on();
}

/* ============================================================
   Operaciones sobre el MFRC522
   ============================================================ */

/**
 * @brief   Activar la antena (habilitar TX1 y TX2).
 */
void mfrc522_antena_on(void) {
  uint8_t valor = mfrc522_leer_registro(MFRC522_TXCONTROLREG);
  if (!(valor & 0x03)) {
    mfrc522_activar_bits(MFRC522_TXCONTROLREG, 0x03);
  }
}

/**
 * @brief   Desactivar la antena (deshabilitar TX1 y TX2).
 */
void mfrc522_antena_off(void) {
  mfrc522_borrar_bits(MFRC522_TXCONTROLREG, 0x03);
}

/**
 * @brief   Ejecutar un comando Transceive (transmisión + recepción automática).
 *
 * @details Carga los bytes de p_buffer_tx en la FIFO, ejecuta el comando TRANSCEIVE,
 * espera a que finalice (timeout ~200 iteraciones × retardo interno del SSP) y lee
 * los bytes recibidos de la FIFO.
 *
 * @param[in]   p_buffer_tx    Bytes a transmitir (máx. 64).
 * @param[in]   tam_buffer_tx  Número de bytes a transmitir.
 * @param[out]  p_buffer_rx    Buffer de recepción (mín. 64 bytes recomendado).
 * @param[out]  bytes_rx       Número de bytes recibidos.
 *
 * @retval  TRUE   Comunicación correcta, sin errores.
 * @retval  FALSE  Timeout o error de comunicación.
 */
bool_t mfrc522_comando_transceive(uint8_t *p_buffer_tx, uint32_t tam_buffer_tx,
                                  uint8_t *p_buffer_rx, uint32_t *bytes_rx) {
  uint8_t  commirqreg, error, recibidos;
  uint16_t i;

  *bytes_rx = 0;

  /* Preparar el RC522 para la operación */
  mfrc522_escribir_registro(MFRC522_COMMANDREG,  MFRC522_IDLE);
  mfrc522_escribir_registro(MFRC522_COMMIENREG,  0xF7);          /* Habilitar todas las IRQ */
  mfrc522_escribir_registro(MFRC522_COMMIRQREG,  0x80);          /* Limpiar flags de IRQ    */
  mfrc522_escribir_registro(MFRC522_FIFOLEVELREG, MFRC522_BIT_VACIARFIFO); /* Vaciar FIFO  */

