OroJackson01/lpc4088-rfid-access-control/src/mfrc522_lpc40xx.c
  /* Cargar datos de transmisión en la FIFO */
  for (i = 0; i < (uint16_t)tam_buffer_tx; i++) {
    mfrc522_escribir_registro(MFRC522_FIFODATAREG, p_buffer_tx[i]);
  }

  /* Arrancar el comando TRANSCEIVE y activar el bit StartSend */
  mfrc522_escribir_registro(MFRC522_COMMANDREG, MFRC522_TRANSCEIVE);
  mfrc522_activar_bits(MFRC522_BITFRAMINGREG, 0x80);

  /* Esperar a que finalice: TimerIRq (bit 0) = timeout,  RxIRq|IdleIRq (bits 5,4) = datos recibidos */
  i = 2000;
  do {
    commirqreg = mfrc522_leer_registro(MFRC522_COMMIRQREG);
    i--;
  } while ((i != 0) && !(commirqreg & 0x01) && !(commirqreg & 0x30));

  /* Desactivar StartSend independientemente del resultado */
  mfrc522_borrar_bits(MFRC522_BITFRAMINGREG, 0x80);

  if (i == 0) {
    return FALSE;  /* Timeout: el RC522 no respondió a tiempo */
  }

  /* Comprobar errores en ERRORREG (máscara 0x1B = ProtocolErr|ParityErr|CRCErr|CollErr) */
  error = mfrc522_leer_registro(MFRC522_ERRORREG);
  if ((error & 0x1B) != 0) {
    return FALSE;
  }

  /* Pequeño retardo para que los bytes se estabilicen en la FIFO */
  timer_retardo_ms(mfrc522_timer, 1);

  /* Leer cuántos bytes hay en la FIFO y extraerlos */
  recibidos = mfrc522_leer_registro(MFRC522_FIFOLEVELREG);
  for (i = 0; i < recibidos; i++) {
    p_buffer_rx[i] = mfrc522_leer_registro(MFRC522_FIFODATAREG);
  }
  *bytes_rx = recibidos;

  return TRUE;
}

/**
 * @brief   Calcular el CRC de un bloque de datos usando el coprocesador interno del RC522.
 *
 * @param[in]   p_buffer_entrada  Datos de entrada (máx. 64 bytes).
 * @param[in]   tam_buffer        Número de bytes de entrada.
 * @param[out]  p_crc             Array de 2 bytes donde se almacena [CRC_LSB, CRC_MSB].
 *
 * @retval  TRUE   CRC calculado correctamente.
 * @retval  FALSE  Timeout.
 */
bool_t mfrc522_comando_calccrc(uint8_t *p_buffer_entrada, uint32_t tam_buffer, uint8_t *p_crc) {
  uint8_t  i, divirqreg;

  /* Limpiar el flag CRCIRQ y vaciar la FIFO */
  mfrc522_borrar_bits(MFRC522_DIVIRQREG,    MFRC522_BIT_CRCIRQ);
  mfrc522_escribir_registro(MFRC522_FIFOLEVELREG, MFRC522_BIT_VACIARFIFO);

  /* Cargar los datos en la FIFO */
  for (i = 0; i < (uint8_t)tam_buffer; i++) {
    mfrc522_escribir_registro(MFRC522_FIFODATAREG, p_buffer_entrada[i]);
  }

  /* Arrancar el cálculo */
  mfrc522_escribir_registro(MFRC522_COMMANDREG, MFRC522_CALCCRC);

  /* Esperar hasta que CRCIRQ se active */
  i = 0xFF;
  do {
    divirqreg = mfrc522_leer_registro(MFRC522_DIVIRQREG);
    i--;
  } while ((i != 0) && !(divirqreg & MFRC522_BIT_CRCIRQ));

  if (i == 0) {
    return FALSE;  /* Timeout */
  }

  /* Leer resultado: LSB primero, MSB segundo */
  p_crc[0] = mfrc522_leer_registro(MFRC522_CRCRESULTREGL);
  p_crc[1] = mfrc522_leer_registro(MFRC522_CRCRESULTREGH);

  return TRUE;
}

/**
 * @brief   Ejecutar autentificación MIFARE Classic (comando MFAuthent).
 *
 * @param[in]   modo              PICC_AUTHENTA (0x60) o PICC_AUTHENTB (0x61).
 * @param[in]   direccion_bloque  Dirección del trailer block del sector a autenticar.
 * @param[in]   p_clave_sector    Puntero a los 6 bytes de la clave del sector.
 * @param[in]   p_uid             Puntero a los 4 bytes del UID de la tarjeta.
 *
 * @retval  TRUE   Autenticación exitosa (bit CRYPTO1ON activado en STATUS2REG).
 * @retval  FALSE  Fallo o timeout.
 *
 * @note ¡Función no comprobada!
 */
bool_t mfrc522_comando_mfauthent(uint8_t modo, uint8_t direccion_bloque,
                                 const uint8_t *p_clave_sector, uint8_t *p_uid) {
  uint8_t status2, i, commirq_reg, command_reg, intentos = 0, fifo_buffer[12];

  /* Construir los 12 bytes del FIFO: modo + bloque + clave (6) + UID (4) */
  fifo_buffer[0] = modo;
  fifo_buffer[1] = direccion_bloque;
  memcpy(&fifo_buffer[2], p_clave_sector, 6);
  memcpy(&fifo_buffer[8], p_uid, 4);

  /* Vaciar FIFO y cargar los datos */
  mfrc522_escribir_registro(MFRC522_FIFOLEVELREG, 0x80);
  for (i = 0; i < 12; i++) {
    mfrc522_escribir_registro(MFRC522_FIFODATAREG, fifo_buffer[i]);
  }

  /* Ejecutar el comando */
  mfrc522_escribir_registro(MFRC522_COMMANDREG, MFRC522_MFAUTHENT);

  /* Esperar a que el comando finalice */
  i = 0xFF;
  do {
    commirq_reg = mfrc522_leer_registro(MFRC522_COMMIRQREG);
    command_reg = mfrc522_leer_registro(MFRC522_COMMANDREG);
    i--;
  } while ((i != 0) && !(commirq_reg & 0x01) && ((command_reg & 0x0F) == 0x0E));

  if (i == 0) {
    return FALSE;
  }

  /* Verificar que el bit CRYPTO1ON se activó (autenticación exitosa) */
  do {
    status2 = mfrc522_leer_registro(MFRC522_STATUS2REG);
    if (status2 & 0x08) {
      return TRUE;
    }
    intentos++;
  } while (intentos < 255);

  return FALSE;
}

/* ============================================================
   Operaciones sobre la tarjeta PICC
   ============================================================ */

/**
 * @brief   Enviar el comando REQA a la tarjeta (ISO/IEC 14443 Request).
 *
 * @param[out]  p_atqa  Buffer de 2 bytes donde se almacena la respuesta ATQA de la tarjeta.
 *
 * @retval  TRUE   La tarjeta respondió con 2 bytes de ATQA.
 * @retval  FALSE  Sin tarjeta o error de comunicación.
 */
bool_t mfrc522_picc_request(uint8_t *p_atqa) {
  uint32_t bytes_rx;
  uint8_t  buffer_tx[1];

  /* ISO/IEC 14443-3A: REQA usa 7 bits, no el byte completo */
  mfrc522_escribir_registro(MFRC522_BITFRAMINGREG, 7);

  buffer_tx[0] = PICC_REQUEST;
  if (mfrc522_comando_transceive(buffer_tx, 1, p_atqa, &bytes_rx) && bytes_rx == 2) {
    return TRUE;
  }
  return FALSE;
}

/**
 * @brief   Enviar el comando WUPA a la tarjeta (Wake-Up, reactiva tarjetas en HALT).
 *
 * @param[out]  p_atqa  Buffer de 2 bytes para la respuesta ATQA.
 *
 * @retval  TRUE   Tarjeta despertada correctamente.
 * @retval  FALSE  Sin tarjeta o error.
 */
bool_t mfrc522_picc_wakeup(uint8_t *p_atqa) {
  uint32_t bytes_rx;
  uint8_t  buffer_tx[1];

  mfrc522_escribir_registro(MFRC522_BITFRAMINGREG, 7);

  buffer_tx[0] = PICC_WAKEUP;
  if (mfrc522_comando_transceive(buffer_tx, 1, p_atqa, &bytes_rx) && bytes_rx == 2) {
    return TRUE;
  }
  return FALSE;
}

/**
 * @brief   Ejecutar el procedimiento de anticollisión (Cascade Level 1).
 *
 * @details Solicita el UID de la tarjeta y valida la integridad mediante el BCC
 * (XOR de los 4 bytes del UID). Solo retorna TRUE si se reciben exactamente
 * 5 bytes (4 UID + 1 BCC) y el BCC es correcto.
 *
 * @param[out]  p_uid_bcc  Buffer de ≥5 bytes: [UID0, UID1, UID2, UID3, BCC].
 * @param[out]  bytes_rx   Número de bytes recibidos.
 *
 * @retval  TRUE   UID recibido y BCC válido.
 * @retval  FALSE  Error de comunicación o BCC inválido.
 */
bool_t mfrc522_picc_anticollision(uint8_t *p_uid_bcc, uint32_t *bytes_rx) {
  uint8_t buffer_tx[2];
  uint8_t i, bcc_calculado = 0;

  mfrc522_escribir_registro(MFRC522_BITFRAMINGREG, 0);

  buffer_tx[0] = PICC_CL1;
  buffer_tx[1] = PICC_ANTICOLLISION;

