OroJackson01/lpc4088-rfid-access-control/src/mfrc522_lpc40xx.c
  if (mfrc522_comando_transceive(buffer_tx, 2, p_uid_bcc, bytes_rx) && *bytes_rx == 5) {
    /* Validar BCC: XOR de los 4 bytes del UID */
    for (i = 0; i < 4; i++) {
      bcc_calculado ^= p_uid_bcc[i];
    }
    if (bcc_calculado == p_uid_bcc[4]) {
      return TRUE;
    }
  }
  return FALSE;
}

/**
 * @brief   Enviar el comando HALT para finalizar la comunicación con la tarjeta.
 *
 * @retval  TRUE   Comando enviado correctamente.
 * @retval  FALSE  Error al calcular el CRC o en la transmisión.
 */
bool_t mfrc522_picc_halt(void) {
  uint8_t  crc[2], buffer[4];
  uint32_t bytes_rx;

  buffer[0] = PICC_HALT;
  buffer[1] = 0;

  if (!mfrc522_comando_calccrc(buffer, 2, crc)) {
    return FALSE;
  }

  buffer[2] = crc[0];
  buffer[3] = crc[1];

  return mfrc522_comando_transceive(buffer, 4, buffer, &bytes_rx);
}

/**
 * @brief   Seleccionar la tarjeta usando su UID (Cascade Level 1 SELECT).
 *
 * @details Envía el comando SELECT con el UID + BCC y espera el SAK (0x08 para MIFARE 1K).
 * Reintenta hasta 10 veces si no se recibe un SAK válido.
 *
 * @param[in]   p_uid_bcc  Array de 5 bytes: [UID0..UID3, BCC].
 *
 * @retval  TRUE   Tarjeta seleccionada (SAK = 0x08 recibido).
 * @retval  FALSE  Error o SAK no válido tras 10 intentos.
 */
bool_t mfrc522_picc_select(uint8_t *p_uid_bcc) {
  bool_t   resp;
  uint32_t bytes_rx;
  uint8_t  crc[2], buffer_tx[9], buffer_rx[3], intentos = 0;

  buffer_tx[0] = PICC_CL1;
  buffer_tx[1] = PICC_SELECT;
  memcpy(&buffer_tx[2], p_uid_bcc, 5);  /* 4 bytes UID + 1 byte BCC */

  resp = mfrc522_comando_calccrc(buffer_tx, 7, crc);
  ASSERT(resp, "Error al calcular el CRC en PICC_SELECT.");

  buffer_tx[7] = crc[0];
  buffer_tx[8] = crc[1];

  do {
    resp = mfrc522_comando_transceive(buffer_tx, 9, buffer_rx, &bytes_rx);
    if (resp && bytes_rx == 1 && buffer_rx[0] == 0x08) {
      return TRUE;
    }
    intentos++;
  } while (intentos < 10);

  return FALSE;
}

/**
 * @brief   Leer un bloque de 16 bytes de la tarjeta MIFARE Classic.
 *
 * @details Requiere autenticación previa del sector con mfrc522_comando_mfauthent().
 *
 * @param[in]   direccion_bloque   Número del bloque a leer (0-63 para MIFARE 1K).
 * @param[out]  p_datos_bloque_rx  Buffer de ≥16 bytes donde se almacenan los datos leídos.
 *
 * @retval  TRUE   Lectura correcta (se recibieron 18 bytes: 16 datos + 2 CRC).
 * @retval  FALSE  Error en la comunicación o longitud inesperada.
 */
bool_t mfrc522_picc_leer_bloque(uint8_t direccion_bloque, uint8_t *p_datos_bloque_rx) {
  uint8_t  buffer_tx[4], crc[2], buffer_rx[18];
  bool_t   resp;
  uint32_t bytes_rx;
  uint8_t  i;

  ASSERT(p_datos_bloque_rx != NULL, "p_datos_bloque_rx no puede ser nulo.");
  ASSERT(direccion_bloque < 64, "direccion_bloque fuera de rango (0-63).");

  buffer_tx[0] = PICC_READ;
  buffer_tx[1] = direccion_bloque;

  resp = mfrc522_comando_calccrc(buffer_tx, 2, crc);
  ASSERT(resp, "Error al calcular CRC en PICC_READ.");

  buffer_tx[2] = crc[0];
  buffer_tx[3] = crc[1];

  resp = mfrc522_comando_transceive(buffer_tx, 4, buffer_rx, &bytes_rx);
  if (!resp) {
    return FALSE;
  }

  timer_retardo_ms(mfrc522_timer, 2);

  if (bytes_rx != 18) {
    return FALSE;
  }

  for (i = 0; i < 16; i++) {
    p_datos_bloque_rx[i] = buffer_rx[i];
  }

  return TRUE;
}

/**
 * @brief   Escribir un bloque de 16 bytes en la tarjeta MIFARE Classic.
 *
 * @details Requiere autenticación previa del sector. El protocolo consta de dos partes:
 *          1) Enviar WRITE + dirección + CRC  → la tarjeta responde ACK (0x0A).
 *          2) Enviar los 16 bytes de datos + CRC → la tarjeta responde ACK (0x0A).
 *
 * @param[in]   direccion_bloque    Número del bloque a escribir (0-63).
 * @param[in]   p_datos_bloque_tx   Buffer de 16 bytes con los datos a escribir.
 * @param[in]   tam_datos           Debe ser 16.
 *
 * @retval  TRUE   Escritura completada (ambos ACK recibidos).
 * @retval  FALSE  Error en comunicación, CRC o respuesta inesperada.
 */
bool_t mfrc522_picc_escribir_bloque(uint8_t direccion_bloque, uint8_t *p_datos_bloque_tx,
                                    uint8_t tam_datos) {
  uint8_t  buffer_tx[4], buffer_datos[18], buffer_rx[4], crc[2];
  uint32_t bytes_rx;
  bool_t   resp;
  uint8_t  i;

  ASSERT(p_datos_bloque_tx != NULL, "p_datos_bloque_tx no puede ser nulo.");
  ASSERT(tam_datos == 16, "tam_datos debe ser 16 bytes para MIFARE Classic.");

  /* Parte 1: enviar comando WRITE + dirección + CRC */
  buffer_tx[0] = PICC_WRITE;
  buffer_tx[1] = direccion_bloque;

  resp = mfrc522_comando_calccrc(buffer_tx, 2, crc);
  ASSERT(resp, "Error al calcular CRC del comando PICC_WRITE.");

  buffer_tx[2] = crc[0];
  buffer_tx[3] = crc[1];

  resp = mfrc522_comando_transceive(buffer_tx, 4, buffer_rx, &bytes_rx);
  ASSERT(resp, "Error en transceive durante WRITE Parte 1.");
  ASSERT(buffer_rx[0] == 0x0A, "ACK no recibido en WRITE Parte 1.");

  /* Parte 2: enviar los 16 bytes de datos + CRC */
  resp = mfrc522_comando_calccrc(p_datos_bloque_tx, tam_datos, crc);
  ASSERT(resp, "Error al calcular CRC de datos en WRITE Parte 2.");

  for (i = 0; i < tam_datos; i++) {
    buffer_datos[i] = p_datos_bloque_tx[i];
  }
  buffer_datos[tam_datos]     = crc[0];
  buffer_datos[tam_datos + 1] = crc[1];

  resp = mfrc522_comando_transceive(buffer_datos, tam_datos + 2, buffer_rx, &bytes_rx);
  ASSERT(resp, "Error en transceive durante WRITE Parte 2.");
  ASSERT(buffer_rx[0] == 0x0A, "ACK no recibido en WRITE Parte 2.");

  return TRUE;
}

/* ============================================================
   Detección de tarjetas
   ============================================================ */

/**
 * @brief   Detectar si hay una tarjeta y obtener su UID (no bloqueante).
 *
 * @details Ejecuta la secuencia: REQA → ANTICOLLISION → HALT.
 * Si la tarjeta responde, su UID (4 bytes) queda en p_uid[0..3].
 *
 * @param[out]  p_uid  Buffer de ≥5 bytes. Los 4 primeros contendrán el UID si retorna TRUE.
 *
 * @retval  TRUE   Tarjeta detectada, UID almacenado en p_uid.
 * @retval  FALSE  Sin tarjeta o BCC inválido.
 */
bool_t mfrc522_detectar_tarjeta(uint8_t *p_uid) {
  bool_t   resp;
  uint32_t num_bytes;

  resp = mfrc522_picc_request(p_uid);

  if (resp) {
    resp = mfrc522_picc_anticollision(p_uid, &num_bytes);
  }

  mfrc522_picc_halt();

  if (resp && num_bytes == 5) {
    return TRUE;
  }
  return FALSE;
}

/**
 * @brief   Esperar (bloqueante) hasta que se detecte una tarjeta.
 *
 * @param[out]  p_uid  Buffer donde se almacenará el UID (≥5 bytes).
 *
 * @warning Nunca retorna si no se presenta una tarjeta.
 */
void mfrc522_esperar_detectar_tarjeta(uint8_t *p_uid) {
  while (!mfrc522_detectar_tarjeta(p_uid)) {
    ;
  }
}

/**
 * @brief   Detectar tarjeta, autenticar, escribir un bloque y hacer HALT (no bloqueante).
 *
 * @param[out]  p_uid              UID de la tarjeta detectada (≥5 bytes).
 * @param[in]   direccion_bloque   Bloque a escribir (0-63).
 * @param[in]   p_datos_bloque_tx  16 bytes a escribir.
 * @param[in]   tam_datos          Debe ser 16.
 *
 * @retval  TRUE   Operación completada.
 * @retval  FALSE  Fallo en cualquier paso.
 */
bool_t mfrc522_detectar_tarjeta_con_escritura(uint8_t *p_uid, uint8_t direccion_bloque,
                                              uint8_t *p_datos_bloque_tx, uint8_t tam_datos) {
  bool_t   resp;
  uint32_t bytes_rx;

  resp = mfrc522_picc_request(p_uid);
  if (!resp) {
    return FALSE;
  }

  resp = mfrc522_picc_anticollision(p_uid, &bytes_rx);
  if (!resp || bytes_rx != 5) {
    return FALSE;
  }

  resp = mfrc522_picc_select(p_uid);
  if (!resp) {
    return FALSE;
  }

  resp = mfrc522_comando_mfauthent(PICC_AUTHENTA, TRAILER_BLOCK_HARDCODED,
                                   clave_A_sector, p_uid);
  if (!resp) {
    return FALSE;
  }

  resp = mfrc522_picc_escribir_bloque(direccion_bloque, p_datos_bloque_tx, tam_datos);
  if (!resp) {
    return FALSE;
  }

  mfrc522_picc_halt();
  mfrc522_borrar_bits(MFRC522_STATUS2REG, 0x08);  /* Detener cifrado CRYPTO1 */

