OroJackson01/lpc4088-rfid-access-control/src/mfrc522_lpc40xx.c
  return TRUE;
}

/**
 * @brief   Esperar (bloqueante) hasta completar detección + autenticación + escritura.
 *
 * @warning Nunca retorna si no se presenta una tarjeta válida.
 */
void mfrc522_esperar_detectar_tarjeta_con_escritura(uint8_t *p_uid, uint8_t direccion_bloque,
                                                    uint8_t *p_datos_bloque_tx, uint8_t tam_datos) {
  while (!mfrc522_detectar_tarjeta_con_escritura(p_uid, direccion_bloque,
                                                 p_datos_bloque_tx, tam_datos)) {
    ;
  }
}

/* ============================================================
   Funciones privadas
   ============================================================ */

/**
 * @brief   Controlar la señal Chip Select (/NSS) del MFRC522.
 * @private
 *
 * @details Cuando funcion_cs = FALSE (GPIO manual, caso habitual con el RC522) se
 * controla el pin directamente y se añade un retardo de 1 µs para respetar los
 * tiempos de setup/hold del RC522 (datasheet tabla 154: tNHNL ≥ 50 ns, pero
 * en práctica 1 µs es suficiente para evitar problemas con el jitter del bus).
 *
 * Cuando funcion_cs = TRUE el hardware SSP gestiona SSEL automáticamente,
 * por lo que esta función no hace nada (spi_transferir ya lo controla).
 *
 * @param[in]   nivel   TRUE  → CS en alto (fin de trama, esclavo desactivado).
 *                      FALSE → CS en bajo (inicio de trama, esclavo activado).
 */
static void mfrc522_seleccionar_esclavo(bool_t nivel) {
  if (!mfrc522_funcion_cs) {
    if (nivel) {
      gpio_pin_a_1(mfrc522_puerto_cs, mfrc522_mascara_pin_cs);  /* CS alto: fin de trama    */
    } else {
      gpio_pin_a_0(mfrc522_puerto_cs, mfrc522_mascara_pin_cs);  /* CS bajo: inicio de trama */
    }
    /* Retardo de 1 µs para respetar tsetup/thold del RC522 */
    timer_retardo_us(mfrc522_timer, 1);
  }
  /* funcion_cs = TRUE: el SSP gestiona SSEL → nada que hacer aquí */
}

/**
 * @brief   Escribir un byte en un registro del MFRC522 via SPI.
 * @private
 *
 * @details Protocolo SPI del RC522 (datasheet sección 8.1.2.3):
 *   Byte de dirección: [ 0 | A5 A4 A3 A2 A1 A0 | 0 ]
 *                        ^                        ^
 *                      bit7=0 (escritura)        bit0=0 siempre
 *   → (registro << 1) & 0x7E
 *
 * Secuencia: CS↓ → enviar dirección → enviar dato → CS↑
 *
 * @param[in]   registro  Dirección del registro destino.
 * @param[in]   dato      Valor a escribir.
 */
static void mfrc522_escribir_registro(uint8_t registro, uint8_t dato) {
  uint8_t direccion = (registro << 1) & 0x7E;  /* bit7=0 → escritura, bit0=0 */

  mfrc522_seleccionar_esclavo(FALSE);       /* CS bajo: activar esclavo          */
  spi_transferir(mfrc522_ssp, direccion);   /* Enviar dirección (byte dummy en RX) */
  spi_transferir(mfrc522_ssp, dato);        /* Enviar dato      (byte dummy en RX) */
  mfrc522_seleccionar_esclavo(TRUE);        /* CS alto: desactivar esclavo        */
}

/**
 * @brief   Leer el contenido de un registro del MFRC522 via SPI.
 * @private
 *
 * @details Protocolo SPI del RC522 (datasheet sección 8.1.2.3):
 *   Byte de dirección: [ 1 | A5 A4 A3 A2 A1 A0 | 0 ]
 *                        ^                        ^
 *                      bit7=1 (lectura)           bit0=0 siempre
 *   → ((registro << 1) & 0x7E) | 0x80
 *
 * Secuencia: CS↓ → enviar dirección → enviar dummy (0x00) y capturar respuesta → CS↑
 *
 * @param[in]   registro  Dirección del registro a leer.
 * @return      Byte leído del registro.
 */
static uint8_t mfrc522_leer_registro(uint8_t registro) {
  uint8_t valor;
  uint8_t direccion = ((registro << 1) & 0x7E) | 0x80;  /* bit7=1 → lectura */

  mfrc522_seleccionar_esclavo(FALSE);              /* CS bajo: activar esclavo             */
  spi_transferir(mfrc522_ssp, direccion);          /* Enviar dirección (respuesta ignorada) */
  valor = spi_transferir(mfrc522_ssp, 0x00);       /* Dummy TX → capturar dato del RC522   */
  mfrc522_seleccionar_esclavo(TRUE);               /* CS alto: desactivar esclavo           */

  return valor;
}

/**
 * @brief   Poner a 1 los bits indicados por mascara en un registro del MFRC522.
 * @private
 *
 * @details Lee el valor actual, aplica OR con la máscara y escribe el resultado.
 *
 * @param[in]   registro  Dirección del registro a modificar.
 * @param[in]   mascara   Bits a poner a 1 (los bits a 0 en la máscara no se alteran).
 */
static void mfrc522_activar_bits(uint8_t registro, uint8_t mascara) {
  uint8_t valor = mfrc522_leer_registro(registro);
  mfrc522_escribir_registro(registro, valor | mascara);
}

/**
 * @brief   Poner a 0 los bits indicados por mascara en un registro del MFRC522.
 * @private
 *
 * @details Lee el valor actual, aplica AND con el complemento de la máscara y escribe el resultado.
 *
 * @param[in]   registro  Dirección del registro a modificar.
 * @param[in]   mascara   Bits a poner a 0 (los bits a 0 en la máscara no se alteran).
 */
static void mfrc522_borrar_bits(uint8_t registro, uint8_t mascara) {
  uint8_t valor = mfrc522_leer_registro(registro);
  mfrc522_escribir_registro(registro, valor & ~mascara);
}